{
  "backend/main.mo": "Motoko canister managing user-scoped thumbnail templates with access control, CRUD operations, and helper merge utilities.",
  "feature_evidence.json": "Feature evidence report mapping high‑level UI and thumbnail‑generation features to their implementing files and components.",
  "frontend-file-summaries.txt": "Prewritten list of concise summaries for all frontend source files used in the project.",
  "frontend/index.css": "Tailwind base and dark‑theme OKLCH variable definitions configuring global colors and UI tokens.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React layout composing header, generator, templates, features, footer, and toaster components.",
  "frontend/src/components/auth/AuthButton.tsx": "Internet Identity login/logout button handling auth state, loading, and query cache clearing.",
  "frontend/src/components/customize/AISuggestions.tsx": "AI suggestion preset UI applying predefined background, style, and title configurations to the editor.",
  "frontend/src/components/customize/CustomizePanel.tsx": "Customization sidebar containing title inputs, style selector, AI suggestions, generation controls, and save dialog.",
  "frontend/src/components/customize/GenerateControls.tsx": "Action controls for AI generation, randomization, and exporting the thumbnail as PNG.",
  "frontend/src/components/customize/SaveTemplateDialog.tsx": "Dialog for saving the current thumbnail editor state as a reusable template, handling authentication and template creation.",
  "frontend/src/components/customize/StyleSelector.tsx": "Grid of selectable thumbnail styles that triggers a style change callback when clicked.",
  "frontend/src/components/layout/Footer.tsx": "Footer with navigation links, branding, and copyright text.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with branding, navigation buttons, and responsive mobile menu handling.",
  "frontend/src/components/preview/PreviewFrame.tsx": "Preview card displaying the rendered thumbnail and a loading overlay during AI generation.",
  "frontend/src/components/preview/ThumbnailCanvas.tsx": "Canvas component that renders a thumbnail using renderThumbnail when editor properties change.",
  "frontend/src/components/sections/FeaturesSection.tsx": "Feature list section showcasing product capabilities with icons and descriptions.",
  "frontend/src/components/sections/GeneratorSection.tsx": "Section combining the thumbnail preview and customization panel powered by useThumbnailEditor.",
  "frontend/src/components/sections/TemplatesSection.tsx": "Template management section allowing authenticated users to view, apply, and delete saved templates.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and invalidates related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context and hook providing login, logout, identity persistence, and status handling.",
  "frontend/src/hooks/useTemplates.ts": "Provides React Query hooks to list, create, and delete templates using an actor backend.",
  "frontend/src/hooks/useThumbnailEditor.ts": "Manages thumbnail editor state with randomization, AI generation, and serialization helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables, and utility classes for the app.",
  "frontend/src/lib/thumbnail/backgrounds.ts": "Exports preset gradient backgrounds and a helper to pick one at random.",
  "frontend/src/lib/thumbnail/exportPng.ts": "Renders a thumbnail to an offscreen canvas and downloads it as a PNG file.",
  "frontend/src/lib/thumbnail/renderThumbnail.ts": "Draws a styled thumbnail onto a canvas, including background, title text, and channel info.",
  "frontend/src/lib/thumbnail/styles.ts": "Defines thumbnail style types and configuration presets for rendering text and visuals.",
  "frontend/src/lib/thumbnail/suggestions.ts": "Provides preset thumbnail suggestions with backgrounds, styles, and sample titles.",
  "frontend/src/lib/thumbnail/titles.ts": "Provides lists of AI‑generated and random default titles for thumbnails.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, goals, architecture, known issues, and implemented features for the ThumbnailAI web app. Serves as a versioned manifest describing UI structure, preview behavior, styling options, and simulated AI actions."
}