{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "ThumbnailAI single-page thumbnail generator (live preview, presets, export, templates, II auth) — frontend",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a responsive single-page ThumbnailAI UI with sticky header, responsive 2-column generator area, features grid, and footer matching the provided HTML labels.",
      "acceptanceCriteria": [
        "On desktop widths, the main content is a two-column layout with Preview on the left and Customize on the right.",
        "On narrow widths, the layout becomes a single column; header nav collapses behind a mobile menu toggle.",
        "The page includes: header, preview section, customization section, features section, and footer sections with the same labels as the provided HTML (in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Implement the single-page structure (sticky header, main generator section with Preview + Customize, Why Choose section, footer) and wire stateful child components for navigation anchors and layout responsiveness."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "create",
          "description": "Create a sticky header with logo/brand, nav links (anchors to sections), and authentication controls slot; responsive layout prepared for mobile menu toggle integration."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "create",
          "description": "Create footer with the required English link labels mirroring the provided HTML’s footer information architecture."
        },
        {
          "path": "frontend/src/components/sections/FeaturesSection.tsx",
          "operation": "create",
          "description": "Implement the “Why Choose ThumbnailAI?” features grid section with required English labels and responsive card/grid layout."
        },
        {
          "path": "frontend/src/components/sections/GeneratorSection.tsx",
          "operation": "create",
          "description": "Implement the generator main section container that composes the Preview and Customize panel into a responsive 2-column layout that collapses to 1 column on small screens."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement a 16:9 thumbnail preview canvas that updates live from editor inputs (title, channel, style, background).",
      "acceptanceCriteria": [
        "Typing in “Video Title” immediately updates the preview title text.",
        "Typing in “Channel Name” immediately updates the preview channel name and the channel logo initial (first letter uppercased).",
        "The preview maintains a 16:9 aspect ratio and is visually centered within its container.",
        "Preview uses a background that can be changed by randomize/generate/preset actions (e.g., gradients)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/preview/ThumbnailPreviewCanvas.tsx",
          "operation": "create",
          "description": "Create a canvas-based preview component that renders a 16:9 thumbnail (scaled to fit) and redraws on state changes for title, channel name (including initial), style, and background gradient/color."
        },
        {
          "path": "frontend/src/lib/thumbnail/renderThumbnail.ts",
          "operation": "create",
          "description": "Add a pure rendering helper to draw the thumbnail to a canvas context (background + title + channel info) so it can be reused for live preview and PNG export."
        },
        {
          "path": "frontend/src/lib/thumbnail/backgrounds.ts",
          "operation": "create",
          "description": "Define predefined/randomizable backgrounds (e.g., gradient definitions) and helpers to pick/apply them for presets/randomize/simulated AI generation."
        },
        {
          "path": "frontend/src/hooks/useThumbnailEditorState.ts",
          "operation": "create",
          "description": "Centralize thumbnail editor state (video title, channel name, selected style, selected background) and provide update helpers used by Customize panel, presets, randomize, and generate actions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add thumbnail style selection (modern, minimal, bold, bright, dark, gradient) with active highlighting and preview text styling behavior consistent with the provided script intent.",
      "acceptanceCriteria": [
        "Clicking a style option updates the active state indicator and updates the preview styling.",
        "The “gradient” style renders the title text as a visible text gradient (not a background block).",
        "The “dark” style renders title text darker with a lighter shadow effect, as in the provided script’s intent."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/customize/StyleSelector.tsx",
          "operation": "create",
          "description": "Implement style selection UI with the six required options, visible active state highlighting, and callbacks to update the editor state."
        },
        {
          "path": "frontend/src/lib/thumbnail/styles.ts",
          "operation": "create",
          "description": "Define style presets (font sizes/weights, fill colors, shadows, gradient text settings) and expose a mapping used by the renderer to match the provided script behavior."
        },
        {
          "path": "frontend/src/lib/thumbnail/renderThumbnail.ts",
          "operation": "modify",
          "description": "Apply style presets to title/channel rendering, including gradient text rendering for the “gradient” style and adjusted shadow intent for “dark”."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement AI Suggestions preset cards that apply background + style + title and show a non-blocking confirmation message.",
      "acceptanceCriteria": [
        "Clicking each preset updates: background, selected style, and video title to the preset’s values.",
        "The UI provides a non-blocking notification (toast or inline message) that a preset was applied (avoid using browser alert)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/customize/AISuggestions.tsx",
          "operation": "create",
          "description": "Implement preset cards for clickbait, educational, gaming, vlog; on click apply the preset (background/style/title) via editor state updates."
        },
        {
          "path": "frontend/src/lib/thumbnail/suggestions.ts",
          "operation": "create",
          "description": "Define the four suggestion presets and their associated background/style/title values consistent with the provided HTML/JS logic intent."
        },
        {
          "path": "frontend/src/components/feedback/ToastProvider.tsx",
          "operation": "create",
          "description": "Add a lightweight toast/inline notification provider and hook (no browser alerts) to show confirmations like “Preset applied”."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the ToastProvider at the app root and trigger a toast when a suggestion preset is applied."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement simulated “Generate with AI” with a ~1.5s loading overlay that blocks preview interactions, then applies randomized background/style/title and shows success confirmation.",
      "acceptanceCriteria": [
        "When clicking “Generate with AI”, a loading overlay appears on top of the preview and blocks interactions with preview controls until completion.",
        "After the delay, a new randomized background/style/title are applied and the overlay disappears.",
        "A success confirmation is shown using an in-app UI element (toast/inline), not browser alert."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/customize/GenerateControls.tsx",
          "operation": "create",
          "description": "Create action buttons including “Generate with AI” and manage simulated generation flow (start loading, wait ~1.5s, apply random background/style/title, stop loading, show toast)."
        },
        {
          "path": "frontend/src/components/preview/PreviewFrame.tsx",
          "operation": "create",
          "description": "Wrap the preview canvas with a loading overlay layer that blocks interactions while simulated AI generation is running."
        },
        {
          "path": "frontend/src/hooks/useThumbnailEditorState.ts",
          "operation": "modify",
          "description": "Add helpers for simulated generation (random pick title/style/background) and an isGenerating flag to drive the preview overlay and button disabled states."
        },
        {
          "path": "frontend/src/lib/thumbnail/titles.ts",
          "operation": "create",
          "description": "Add the predefined list of titles used by simulated generation/randomize, matching the provided script’s intent (no real AI integration)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Implement “Randomize” to immediately randomize background + style + title and update the active style indicator.",
      "acceptanceCriteria": [
        "Clicking “Randomize” changes the preview background, style, and title without any loading overlay.",
        "The selected style UI updates to match the randomized style."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/customize/GenerateControls.tsx",
          "operation": "modify",
          "description": "Add the “Randomize” action to immediately apply randomized background/style/title without overlay and ensure it updates the selected style UI."
        },
        {
          "path": "frontend/src/hooks/useThumbnailEditorState.ts",
          "operation": "modify",
          "description": "Add/adjust an immediate randomize helper that updates editor state and ensures the style selection state stays in sync."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Export the currently rendered thumbnail as a real 1280x720 PNG on the client with a disabled/loading button state during export.",
      "acceptanceCriteria": [
        "Clicking “Download Thumbnail” downloads a .png file.",
        "The exported image resolution is 1280x720 and visually matches the preview (background + title + channel info).",
        "While exporting, the download button shows a disabled/loading state and then returns to normal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/thumbnail/exportPng.ts",
          "operation": "create",
          "description": "Implement client-side PNG export by rendering the current thumbnail state to an offscreen canvas at 1280x720 using the shared renderer, then triggering a download."
        },
        {
          "path": "frontend/src/components/customize/DownloadButton.tsx",
          "operation": "create",
          "description": "Create “Download Thumbnail” button that calls exportPng, shows disabled/loading state during export, and returns to normal after completion."
        },
        {
          "path": "frontend/src/components/sections/GeneratorSection.tsx",
          "operation": "modify",
          "description": "Wire the DownloadButton into the Customize panel area as the primary export action."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add responsive header navigation with a mobile menu toggle that shows/hides nav items and switches the toggle icon state.",
      "acceptanceCriteria": [
        "On small screens, the nav is hidden until the menu button is toggled.",
        "Toggling the menu changes the menu button’s visual state (open vs closed).",
        "On larger screens, the nav is always visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Implement the mobile nav toggle behavior (show/hide nav items on small screens; always visible on larger screens) and toggle visual state for open/closed."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Implement Internet Identity sign-in/sign-out via existing template hooks and update header to reflect authentication state (no immutable hook edits).",
      "acceptanceCriteria": [
        "Clicking “Sign In” triggers an Internet Identity login flow.",
        "After login, the header shows an authenticated state (e.g., “Sign out” and/or the user principal/account indicator).",
        "Clicking “Sign out” ends the session and returns the UI to the signed-out state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AuthButton.tsx",
          "operation": "create",
          "description": "Use the authorization component’s provided Internet Identity hook patterns to implement Sign In / Sign Out UI behavior in the header. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Replace the placeholder Sign In behavior by wiring AuthButton into the header and show authenticated vs signed-out states."
        },
        {
          "path": "frontend/src/hooks/useCurrentUser.ts",
          "operation": "create",
          "description": "Use the authorization component guidance to derive an isAuthenticated flag and (optionally) a user display label; ensure React Query cache is cleared on logout per the authorization usage notes. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Implement Templates UI for signed-in users: save current configuration as named template, list/apply/delete templates, and show a sign-in CTA for signed-out users.",
      "acceptanceCriteria": [
        "Signed-in users can save the current configuration (title, channel name, style, background) as a template with a user-provided name.",
        "The app shows a list/grid of saved templates for the signed-in user.",
        "Clicking a saved template applies it to the preview and updates editor inputs + selected style.",
        "Users can delete a saved template; it disappears from the list without a page refresh.",
        "Signed-out users can see a call-to-action to sign in to use templates and cannot persist templates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/templates/useTemplates.ts",
          "operation": "create",
          "description": "Implement React Query hooks (query + mutations) that call the existing backend actor capabilities for listing, creating, and deleting templates; keep cache in sync without refresh."
        },
        {
          "path": "frontend/src/components/templates/TemplatesSection.tsx",
          "operation": "create",
          "description": "Create a Templates section that (1) shows a sign-in CTA when signed out and (2) when signed in allows naming/saving current configuration, listing templates, applying a template to the editor, and deleting templates."
        },
        {
          "path": "frontend/src/lib/templates/configMapping.ts",
          "operation": "create",
          "description": "Add mapping helpers to convert between the editor state (title/channel/style/background) and the backend Template/ThumbnailConfig shape used by actor calls."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire TemplatesSection into the single-page nav/sections and connect it to the shared editor state so applying templates updates preview and inputs."
        },
        {
          "path": "frontend/src/components/auth/AuthButton.tsx",
          "operation": "modify",
          "description": "Ensure templates CTA can trigger the same Internet Identity login flow; use the authorization component’s recommended patterns. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Apply a cohesive dark, YouTube-inspired theme (near-black surfaces + red accent) with Tailwind styling and consistent component states.",
      "acceptanceCriteria": [
        "The app uses a consistent dark theme with red accent across header, cards, buttons, and interactive states.",
        "Typography and spacing are consistent across sections; cards and buttons have clear hover/focus styles.",
        "Primary actions (Generate/Download/Sign In) are visually distinct from secondary actions (Randomize)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Add Tailwind base/components/utilities imports plus global CSS variables and base styles to enforce a near-black theme with red accent, consistent typography, and focus/hover/disabled states."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the app renders in dark mode (e.g., applying the appropriate dark class at the root) and standardize spacing/typography scale across sections."
        },
        {
          "path": "frontend/src/components/customize/GenerateControls.tsx",
          "operation": "modify",
          "description": "Apply Tailwind classes for primary vs secondary actions (Generate/Download/Sign In as primary; Randomize as secondary) with consistent hover/active/disabled styles matching the theme."
        },
        {
          "path": "frontend/src/components/customize/StyleSelector.tsx",
          "operation": "modify",
          "description": "Apply Tailwind styling for consistent card/button states and clearly highlighted active style selection using the red accent palette."
        }
      ]
    }
  ]
}